### Importing Libraries

In [3]:
import pandas as pd

### Data

In [4]:
df = pd.read_csv('clean_data.csv')

In [5]:
df.head()

,Links,Name,Price,Location,Mileage,Transmission,Exterior Colour,Engine,Drivetrain,Fuel Type,Major Options
0,ViewedSave this listing2017 Volkswagen Golf 1....,2017 Volkswagen Golf 1.8T Comfortline 4-Door F...,"$15,990","New Westminster, BC\n6 km away","83,000 kilometres",Automatic,White,NaN,NaN,NaN,"Bluetooth, Backup Camera, Heated Seats, CarPlay"
1,ViewedSave this listing2019 RAM 1500 Classic T...,2019 RAM 1500 Classic Tradesman Crew Cab 4WD -...,"$38,900","New Westminster, BC\n6 km away","26,000 kilometres",Automatic,Blue,305 hp 3.6L V6 Flex Fuel Vehicle,Four-Wheel Drive,Flex Fuel Vehicle,"Alloy Wheels, Bluetooth, Backup Camera, Remote..."
2,ViewedSave this listing2015 Lexus NX 200t AWD$...,"2015 Lexus NX 200t AWD - $28,900","$28,900","Port Coquitlam, BC\n16 km away","49,000 kilometres",Automatic,Silver,235 hp 2L I4,All-Wheel Drive,Gasoline,"Sport Package, Bluetooth, Backup Camera, Heate..."
3,ViewedSave this listing2003 Toyota Tacoma Prer...,2003 Toyota Tacoma Prerunner V6 Crew Cab SB - ...,"$11,980","Burnaby, BC\n5 km away","216,288 kilometres",Automatic,Red,190 hp 3.4L V6,Rear-Wheel Drive,Gasoline,Alloy Wheels
4,ViewedSave this listing2015 INFINITI Q70 3.7 A...,"2015 INFINITI Q70 3.7 AWD - $16,888","$16,888","Victoria, BC\n91 km away","144,718 kilometres",7-Speed Automatic,Black,330 hp 3.7L V6,All-Wheel Drive,Gasoline,"Leather Seats, Sunroof/Moonroof, Navigation Sy..."

In [6]:
df.shape

(3072, 11)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3072 entries, 0 to 3071
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Links            3072 non-null   object
 1   Name             3040 non-null   object
 2   Price            3068 non-null   object
 3   Location         2978 non-null   object
 4   Mileage          3070 non-null   object
 5   Transmission     3014 non-null   object
 6   Exterior Colour  2805 non-null   object
 7   Engine           2424 non-null   object
 8   Drivetrain       2239 non-null   object
 9   Fuel Type        2460 non-null   object
 10  Major Options    2470 non-null   object
dtypes: object(11)
memory usage: 264.1+ KB

In [8]:
df.describe()

,Links,Name,Price,Location,Mileage,Transmission,Exterior Colour,Engine,Drivetrain,Fuel Type,Major Options
count,3072,3040,3068,2978,3070,3014,2805,2424,2239,2460,2470
unique,2671,2464,1466,95,2352,20,395,441,5,6,1061
top,ViewedSave this listing2002 Toyota Sienna CE$3...,"2002 Toyota Sienna CE - $3,990","$5,900","Richmond, BC\n8 km away","201,000 kilometres",Automatic,White,395 hp 5.7L V8,All-Wheel Drive,Gasoline,Alloy Wheels
freq,21,30,35,181,31,2262,527,123,724,2153,75

In [22]:
###########################################################

In [23]:
#df['Major Options'] =df['Major Options'].apply(lambda x: str(x).split(',')) if x!= -1 else x)

In [24]:
df['Links'][3067]

"Save this listing2018 Mazda CX-5 GS AWD$26,490 ·$511/mo est.**Estimated payments are for informational purposes only and do not represent a financing offer or guarantee of credit from the seller or from CarGurus. Estimated payments are calculated based on the Dealer's Price and may or may not include freight, fees, license, insurance, registration and taxes. Dealer rates may differ. Monthly Estimate based on a 4.4% APR for 60 months, $26,490 vehicle price, $0 down payment, $0 trade-in, $0 sales tax.99,118 kmRichmond, BC (10 km)GOOD DEAL$1,720 below market(604) 200-2879Request Info"

In [25]:
#df['Engine-L'] = df['Engine'].str.extract('([0-9]+\\.*[0-9]*L)', expand=False).str.strip()

In [26]:
df['Links'][889]
#df['Engine-hp'] = df['Engine'].str.extract('([0-9]+\shp)', expand=False).str.strip()

"Image Not AvailableSave this listing2019 Nissan Pathfinder SL 4WD$40,691 ·$785/mo est.**Estimated payments are for informational purposes only and do not represent a financing offer or guarantee of credit from the seller or from CarGurus. Estimated payments are calculated based on the Dealer's Price and may or may not include freight, fees, license, insurance, registration and taxes. Dealer rates may differ. Monthly Estimate based on a 4.4% APR for 60 months, $40,691 vehicle price, $0 down payment, $0 trade-in, $0 sales tax.31,371 kmNanaimo, BC (72 km)GREAT DEAL$3,530 below marketRequest Info"

In [27]:
# df['Car-Type'] = df['Links'].str.extract(r'([0-9]\s[a-zA-Z0-9\s.-\\]+[$][0-9])', expand=False).str.strip()
#df['Tutle'] = df['Engine'].str.extract('([V|I]+[\d]+)', expand=False)

In [28]:
df['Car-Type'] = df['Links'].str.extract(r'(?:20[0-9][0-9]\s)([a-zA-Z0-9\s-]+)(?:\$[0-9][0-9]?\,)', expand=False)

In [29]:
# df['Car-Type'] = df['Links'].str.extract(r'(20[0-9]{2}\s)([a-zA-Z0-9\s.\\-])+(\$[0-9][0-9]?,)', expand=False).str.strip()
#(20[0-9]{2}\s)([a-zA-Z0-9\s.\\-])+(\$[0-9][0-9]?,)

In [31]:
df['Car-Type'][1656]

'Jeep Wrangler Sahara'

In [30]:
df['Links'][1656]

"Save this listing2013 Jeep Wrangler Sahara$21,898 ·$423/mo est.**Estimated payments are for informational purposes only and do not represent a financing offer or guarantee of credit from the seller or from CarGurus. Estimated payments are calculated based on the Dealer's Price and may or may not include freight, fees, license, insurance, registration and taxes. Dealer rates may differ. Monthly Estimate based on a 4.4% APR for 60 months, $21,898 vehicle price, $0 down payment, $0 trade-in, $0 sales tax.186,000 kmMaple Ridge, BC (29 km)GOOD DEAL$2,933 below market(604) 239-1718Request Info"

In [32]:
df[df['Car-Type'] == 'Toyota Tacoma TRD Sport Double Cab LB 4WD']

,Links,Name,Price,Location,Mileage,Transmission,Exterior Colour,Engine,Drivetrain,Fuel Type,Major Options,Car-Type
2683,Save this listing2018 Toyota Tacoma TRD Sport ...,2018 Toyota Tacoma TRD Sport Double Cab LB 4WD...,"$40,297","Langley, BC\n29 km away","126,227 kilometres",Automatic,Gray (Magnetic Grey Metallic),278 hp 3.5L V6,Four-Wheel Drive,Gasoline,"Navigation System, Adaptive Cruise Control, Al...",Toyota Tacoma TRD Sport Double Cab LB 4WD
3006,Save this listing2018 Toyota Tacoma TRD Sport ...,2018 Toyota Tacoma TRD Sport Double Cab LB 4WD...,"$44,990","Vancouver, BC\n10 km away","76,179 kilometres",6-Speed Automatic Overdrive,Gray (Magnetic Grey),278 hp 3.5L V6,Four-Wheel Drive,Gasoline,"Sport Package, TRD Package, Navigation System,...",Toyota Tacoma TRD Sport Double Cab LB 4WD

In [33]:
df['Car-Type'].value_counts().sample(50)

Mazda MAZDA3 Premium Hatchback AWD                       2
Cadillac Escalade 4WD                                    1
Toyota Tacoma                                           10
RAM 1500 Classic Warlock Quad Cab 4WD                    8
Jeep Grand Cherokee L Overland 4WD                       1
Ford Explorer XLT AWD                                    1
Volkswagen Golf R 4-Door AWD with DCC and Navigation     1
Subaru XV Crosstrek Touring AWD                          1
Chevrolet City Express LT FWD                            1
BMW X5 sDrive35i RWD                                     1
MINI Countryman Cooper S ALL4 AWD                        1
Toyota Camry                                             3
Land Rover Discovery Td6 HSE Luxury AWD                  1
RAM 1500 Classic Express Quad Cab 4WD                    2
Toyota Tacoma TRD Sport Double Cab LB 4WD                2
RAM 1500 Limited Crew Cab LB 4WD                         1
Tesla Model X 90D AWD                                    1
Volvo XC40 T5 R-Design AWD                               1
Subaru WRX STI FWD                                       1
Mazda CX-9 Grand Touring AWD                             1
Mercedes-Benz E-Class E 550 Coupe                        1
Jeep Compass X High Altitude 4WD                         1
smart fortwo passion                                     3
Toyota Sienna CE                                        30
GMC Acadia SLE AWD                                       1
RAM 1500 Classic Warlock Crew Cab 4WD                    4
Acura RDX SH-AWD with A-Spec Package                     1
Mazda CX-9 Signature AWD                                 2
Lexus NX 200t                                            1
Ford F-150 FX4 SuperCrew 4WD                             1
Nissan Pathfinder                                        3
BMW X5 xDrive40i AWD                                    13
Lincoln MKT EcoBoost AWD                                 1
BMW X7 xDrive40i AWD                                     1
Land Rover Range Rover V8 Supercharged 4WD               1
Ford Focus SE                                            3
Audi RS 5 quattro Cabriolet AWD                          1
Acura TLX FWD with Elite Package                         1
Ford F-350 Super Duty King Ranch Crew Cab 4WD            1
Ford F-150 Lariat SuperCrew 4WD                          5
Lexus IS 350 AWD                                         2
Jeep Wrangler Unlimited Sport 4WD 4WD                    1
Mercedes-Benz CLS-Class CLS AMG 53 S 4MATIC AWD          1
Volkswagen Passat                                        2
Acura MDX SH-AWD with Technology Package                 1
Mercedes-Benz C-Class C AMG 43 4MATIC AWD                1
Ford Bronco Wildtrak Advanced 4-Door 4WD                 1
Toyota RAV4 AWD                                          1
Nissan Maxima SL FWD                                     2
Jaguar F-PACE 25t Premium AWD                            1
Name: Car-Type, dtype: int64

In [34]:
df[df['Car-Type'] == 'XL LB']['Links']

Series([], Name: Links, dtype: object)

In [35]:
df['Car-Type'].value_counts().tail(50)

Buick Encore Sport Touring AWD                                                           1
Mercedes-Benz GLS-Class GLS AMG 63 4MATIC AWD                                            1
Jeep Grand Cherokee 80th Anniversary Edition 4WD                                         1
RAM 3500 Big Horn Mega Cab 4WD                                                           1
Subaru Outback Limited XT Wagon AWD                                                      1
Nissan NV200 SV FWD                                                                      1
Hyundai Ioniq Hybrid Essential FWD                                                       1
Jaguar F-PACE 25t Prestige AWD                                                           1
RAM 1500 Classic SLT Crew Cab RWD                                                        1
Tesla Model X 75D AWD                                                                    1
Volkswagen Tiguan Comfortline AWD                                                        1
Mercedes-Benz C-Class C 300 Coupe 4MATIC AWD                                             1
Nissan Xterra SV 4WD                                                                     1
Honda Civic Type R                                                                       1
Volkswagen Jetta TDI Comfortline                                                         1
Ford Transit Connect Wagon XLT LWB FWD with Rear Liftgate                                1
MINI Cooper S 4-Door Hatchback FWD                                                       1
Volvo C30                                                                                1
Ford E-Series E-250 Cargo Van                                                            1
Nissan Juke NISMO RS                                                                     1
Land Rover Range Rover Velar P250 S AWD                                                  1
Kia Sportage LX                                                                          1
Lexus NX 200t                                                                            1
Acura TLX SH-AWD with A-Spec Package                                                     1
Mercedes-Benz C-Class C AMG 43 4MATIC Cabriolet                                          1
Volkswagen Beetle Trendline                                                              1
Maserati Ghibli S Q4 AWD                                                                 1
Honda Odyssey EX-L FWD                                                                   1
Mercedes-Benz B-Class B 200 T                                                            1
Chevrolet Tahoe LS RWD                                                                   1
Ford Flex SEL AWD                                                                        1
Ford Transit Cargo 250 3dr LWB Medium Roof Cargo Van with Sliding Passenger Side Door    1
Buick Encore GX Essence AWD                                                              1
Hyundai Elantra GT                                                                       1
Chevrolet Silverado 1500 LT Crew Cab LB 4WD                                              1
Chevrolet Cruze Limited 1LT FWD                                                          1
GMC Canyon All Terrain Crew Cab LB 4WD with Cloth                                        1
Jeep Grand Cherokee Summit 4WD                                                           1
Acura RDX SH-AWD with A-Spec Package                                                     1
GMC Acadia SLE-1 AWD                                                                     1
BMW M4 Coupe RWD                                                                         1
Ford Explorer Sport 4WD                                                                  1
GMC Terrain SLT1 AWD                                                                     1
Dodge RAM 3500 Laramie Quad Cab 4WD                                                      1
Chevrolet Colorado Work Truck Extended Cab 4WD                                           1
Chevrolet Spark 2LT FWD                                                                  1
Kia Sorento EX Premium V6 AWD                                                            1
Tesla Model Y Long Range AWD                                                             1
GMC Yukon Denali 4WD                                                                     1
Honda HR-V                                                                               1
Name: Car-Type, dtype: int64

Size of data

In [9]:
df.shape

(3072, 11)

Finding duplicates

In [10]:
# rows where
duplicate_df = df[df.duplicated(['Name', 'Mileage', 'Location'])]

In [11]:
duplicate_df.head()

,Links,Name,Price,Location,Mileage,Transmission,Exterior Colour,Engine,Drivetrain,Fuel Type,Major Options
485,ViewedSave this listingNew Arrival2015 Nissan ...,"2015 Nissan Versa Note SL - $13,800","$13,800","Surrey, BC\n16 km away","18,352 kilometres",Automatic,Gray (Magnetic Grey),109 hp 1.6L I4,Front-Wheel Drive,Gasoline,NaN
487,ViewedSave this listingNew Arrival2016 Jeep Pa...,"2016 Jeep Patriot North Edition 4WD - $13,999","$13,999","Surrey, BC\n16 km away","122,894 kilometres",6-Speed Automatic,NaN,NaN,NaN,NaN,"Leather Seats, Sunroof/Moonroof, Navigation Sy..."
488,ViewedSave this listing2018 Subaru Outback 3.6...,2018 Subaru Outback 3.6R Premier AWD with EyeS...,"$32,900","North Vancouver, BC\n13 km away","37,562 kilometres",Continuously Variable Transmission,Silver,NaN,NaN,NaN,NaN
490,ViewedSave this listing2021 Honda Accord Sport...,"2021 Honda Accord Sport FWD - $33,990","$33,990","Victoria, BC\n91 km away","3,311 kilometres",Continuously Variable Transmission,Gray (Sonic Grey Pearl),192 hp 1.5L I4,Front-Wheel Drive,Gasoline,NaN
508,ViewedSave this listing2018 BMW M4 Convertible...,"2018 BMW M4 Convertible RWD - $76,900","$76,900","North Vancouver, BC\n12 km away","38,682 kilometres",Automatic,Black Sapphire Met,425 hp 3L I6,Rear-Wheel Drive,Gasoline,"Leather Seats, Driver Assistance Package, Exec..."

There are 537 duplicate rows which requires to be removed in order for us to use the data for analysis

In [12]:
#dropping duplicates from dataframe
df = df.drop_duplicates(subset=['Name', 'Mileage', 'Location']).reset_index(drop = True)

Rechecking if there are any duplicates remaining

In [13]:
duplicate_df = df[df.duplicated(['Name', 'Mileage', 'Location'])]
len(duplicate_df)

0

### Cleaning dataframe

In [14]:
df.isnull().sum()

Links                0
Name                31
Price                3
Location            89
Mileage              1
Transmission        57
Exterior Colour    239
Engine             562
Drivetrain         699
Fuel Type          527
Major Options      411
dtype: int64

There are large number of columns which have null value, hence we need to see if we can fill them with mean, mode or median value. Else we will be dropping the column entirely

In [36]:
#df['Location'] = df['Location'].apply(lambda x: x.split(',')[0] if pd.notnull(x) else x)

In [37]:
###########################################################

In [15]:
#drop rows with no Name
df = df[df['Name'].notna()]

At this portion of the cleaning, I will clean the Name column

In [16]:
df['Name'][0]

'2017 Volkswagen Golf 1.8T Comfortline 4-Door FWD - $15,990'

In [17]:
df['year'] = df['Name'].apply(lambda x: int(x.split(' ')[0]))

In [18]:
df['Title'] = df['Name'].apply(lambda x: x.split(' '))

In [19]:
df['Title'][0][1:-2]

['Volkswagen', 'Golf', '1.8T', 'Comfortline', '4-Door', 'FWD']

In [20]:
def Name2Title(x):
    y = x[1:-2]
    str1 = ' '
    
    return ' '.join(y)

In [21]:
df['Title'] = df['Title'].apply(lambda x: Name2Title(x))

In [22]:
df['Title'][546]

'Acura RDX SH-AWD with Platinum Elite Package'

In [23]:
df['Brand'] = df['Title'].apply(lambda x: x.split(' ', 1)[0])

For the column Price remove '$' and convert to int

In [24]:
df['Price'] = df['Price'].apply(lambda x: int(x.replace('$', '').replace(',', '')))

In [25]:
df['Price'].head()

0    15990
1    38900
2    28900
3    11980
4    16888
Name: Price, dtype: int64

For the column Location just keep the City Name

In [26]:
df['Location'] = df['Location'].apply(lambda x: x.split(',')[0] if pd.notnull(x) else x)
df['Location']

0       New Westminster
1       New Westminster
2        Port Coquitlam
3               Burnaby
4              Victoria
             ...
2530                NaN
2531           Victoria
2532        Maple Ridge
2533         Abbotsford
2534          Vancouver
Name: Location, Length: 2504, dtype: object

In [27]:
df.head(2)

,Links,Name,Price,Location,Mileage,Transmission,Exterior Colour,Engine,Drivetrain,Fuel Type,Major Options,year,Title,Brand
0,ViewedSave this listing2017 Volkswagen Golf 1....,2017 Volkswagen Golf 1.8T Comfortline 4-Door F...,15990,New Westminster,"83,000 kilometres",Automatic,White,NaN,NaN,NaN,"Bluetooth, Backup Camera, Heated Seats, CarPlay",2017,Volkswagen Golf 1.8T Comfortline 4-Door FWD,Volkswagen
1,ViewedSave this listing2019 RAM 1500 Classic T...,2019 RAM 1500 Classic Tradesman Crew Cab 4WD -...,38900,New Westminster,"26,000 kilometres",Automatic,Blue,305 hp 3.6L V6 Flex Fuel Vehicle,Four-Wheel Drive,Flex Fuel Vehicle,"Alloy Wheels, Bluetooth, Backup Camera, Remote...",2019,RAM 1500 Classic Tradesman Crew Cab 4WD,RAM

Remove 'kilometers' from the string

In [28]:
df['Mileage'] = df['Mileage'].apply(lambda x: x.replace(',', ''))

In [29]:
df['Mileage'] = df['Mileage'].apply(lambda x: int(x.split(' ', 1)[0]))

In [30]:
df['Mileage'].head()

0     83000
1     26000
2     49000
3    216288
4    144718
Name: Mileage, dtype: int64

In [31]:
df.head(2)

,Links,Name,Price,Location,Mileage,Transmission,Exterior Colour,Engine,Drivetrain,Fuel Type,Major Options,year,Title,Brand
0,ViewedSave this listing2017 Volkswagen Golf 1....,2017 Volkswagen Golf 1.8T Comfortline 4-Door F...,15990,New Westminster,83000,Automatic,White,NaN,NaN,NaN,"Bluetooth, Backup Camera, Heated Seats, CarPlay",2017,Volkswagen Golf 1.8T Comfortline 4-Door FWD,Volkswagen
1,ViewedSave this listing2019 RAM 1500 Classic T...,2019 RAM 1500 Classic Tradesman Crew Cab 4WD -...,38900,New Westminster,26000,Automatic,Blue,305 hp 3.6L V6 Flex Fuel Vehicle,Four-Wheel Drive,Flex Fuel Vehicle,"Alloy Wheels, Bluetooth, Backup Camera, Remote...",2019,RAM 1500 Classic Tradesman Crew Cab 4WD,RAM

Replace Transmission with just Automatic and Manual

In [32]:
df['Transmission'].value_counts()

Automatic                             1787
6-Speed Automatic                      133
8-Speed Automatic                      131
Continuously Variable Transmission     128
Manual                                 113
9-Speed Automatic                       32
6-Speed Manual                          26
7-Speed Automatic                       20
8-Speed Automatic Overdrive             15
5-Speed Automatic                       14
4-Speed Automatic                       14
6-Speed Automatic Overdrive             11
1-Speed Automatic                        6
5-Speed Automatic Overdrive              5
5-Speed Manual                           3
9-Speed Automatic Overdrive              3
6-Speed Manual Overdrive                 3
8-Speed Dual Clutch                      2
7-Speed Automatic Overdrive              1
10-Speed Automatic                       1
Name: Transmission, dtype: int64

In [33]:
'Auto' in df['Transmission'][0]

True

In [34]:
#df['Transmission'] = df['Transmission'].apply(lambda x: x.split(',')[0] if pd.notnull(x) else x)
#df['Transmission'] = df['Transmission'].apply(lambda x: x.replace(',', '') if 'Automatic' in x)

In [35]:
#df.loc[df['Transmission'].str.contains('Auto'), 'Transmission'] = 'ball sport'

In [36]:
df['Transmission'] = df['Transmission'].apply(lambda x: ('Automatic' if 'Automatic' in x else x) if pd.notnull(x) else x)

In [37]:
df['Transmission'] = df['Transmission'].apply(lambda x: ('Manual' if not 'Automatic' in x else x) if pd.notnull(x) else x)

In [38]:
df['Transmission'].value_counts()

Automatic    2173
Manual        275
Name: Transmission, dtype: int64

Limit the color of the car to White, Black, Gray, Blue, Silver, Orange, Red, Green and Others

In [39]:
df['Exterior Colour'].value_counts().head(50)

White                            420
Black                            390
Gray                             274
Blue                             149
Silver                           122
Red                              101
Bright White                      26
Alpine White                      23
Granite Crystal Metallic          14
Polar White                       13
Orange                            13
Brown                             12
Diamond Black Crystal Pearl       12
Crystal Black Pearl               12
Bright White Clearcoat            12
Pure White                        11
Obsidian Black Met                11
Platinum White Pearl              11
Green                             11
Black Sapphire Metallic            9
Fuji White                         8
Onyx Black                         8
Deep Black Pearl                   8
Brown (Beige)                      7
Crystal White Pearl                7
Gray (Mineral Grey Met)            7
Shadow Black                       6
Pearl White                        6
Super White                        6
Billet Metallic                    6
Glacier White                      6
Oxford White                       5
Jet Black                          5
Black Sapphire Met                 5
Gray (Machine Grey Met)            5
Mineral White Met                  5
Brilliant Black Crystal Pearl      5
Crystal White                      5
Carrara White Met                  5
Black Sapphire MET                 5
Gray (Magnetic Grey)               4
Velvet Red Pearl                   4
Navarra Blue MET                   4
Atomic Silver                      4
Snow White Pearl                   4
Ibis White                         4
Pyrite Silver Met                  4
Super Black                        4
Gold                               4
Gray (Modern Steel Met)            4
Name: Exterior Colour, dtype: int64

In [40]:
df['Exterior Colour'].isnull().sum()

237

In [41]:
def Color_sorting(Column):
    Color = ("Black", "White", "Silver", "Red", "Blue", "Gray", "Orange", "Green")
    col1 = Column.apply(lambda x: "Black" if "black" in str(x).lower() else x)
    col2 = col1.apply(lambda x: "White" if "white" in str(x).lower() else x)
    col3 = col2.apply(lambda x: "Gray" if "gray" in str(x).lower() else x)
    col4 = col3.apply(lambda x: "Silver" if "silver" in str(x).lower() else x)
    col5 = col4.apply(lambda x: "Red" if "red" in str(x).lower() else x)
    col6 = col5.apply(lambda x: "Blue" if "blue" in str(x).lower() else x)
    col7 = col6.apply(lambda x: x if x in Color else 'Other')
    return col7  ##cleans color

In [42]:
df['Color'] = Color_sorting(df['Exterior Colour'])
df['Color'].value_counts()

White     647
Black     565
Gray      390
Other     334
Blue      226
Silver    166
Red       152
Orange     13
Green      11
Name: Color, dtype: int64

In [43]:
df['Fuel Type'].value_counts()

Gasoline             1724
Flex Fuel Vehicle     126
Diesel                 51
Electric               35
Hybrid                 25
Biodiesel              24
Name: Fuel Type, dtype: int64

In [44]:
df.head(2)

,Links,Name,Price,Location,Mileage,Transmission,Exterior Colour,Engine,Drivetrain,Fuel Type,Major Options,year,Title,Brand,Color
0,ViewedSave this listing2017 Volkswagen Golf 1....,2017 Volkswagen Golf 1.8T Comfortline 4-Door F...,15990,New Westminster,83000,Automatic,White,NaN,NaN,NaN,"Bluetooth, Backup Camera, Heated Seats, CarPlay",2017,Volkswagen Golf 1.8T Comfortline 4-Door FWD,Volkswagen,White
1,ViewedSave this listing2019 RAM 1500 Classic T...,2019 RAM 1500 Classic Tradesman Crew Cab 4WD -...,38900,New Westminster,26000,Automatic,Blue,305 hp 3.6L V6 Flex Fuel Vehicle,Four-Wheel Drive,Flex Fuel Vehicle,"Alloy Wheels, Bluetooth, Backup Camera, Remote...",2019,RAM 1500 Classic Tradesman Crew Cab 4WD,RAM,Blue

In [45]:
df['Drivetrain'].value_counts()

All-Wheel Drive      654
Front-Wheel Drive    489
Four-Wheel Drive     485
Rear-Wheel Drive     167
4X2                   19
Name: Drivetrain, dtype: int64

Creating a new column for No_of_features from Major Options column

In [46]:
df['No_of_features'] = df['Major Options'].apply(lambda x: len(str(x).split(',')) if pd.notnull(x) else x)

In [47]:
df['No_of_features'].value_counts

<bound method IndexOpsMixin.value_counts of 0       4.0
1       7.0
2       5.0
3       1.0
4       8.0
       ...
2530    4.0
2531    8.0
2532    6.0
2533    4.0
2534    NaN
Name: No_of_features, Length: 2504, dtype: float64>

Change Four-Wheel Drive to All-Wheel Drive in column Drivetrain as both means the same. Also change 4X2 to 'Four-Wheel Drive'

In [48]:
df.columns

Index(['Links', 'Name', 'Price', 'Location', 'Mileage', 'Transmission',
       'Exterior Colour', 'Engine', 'Drivetrain', 'Fuel Type', 'Major Options',
       'year', 'Title', 'Brand', 'Color', 'No_of_features'],
      dtype='object')

In [49]:
df['Drivetrain'] = df['Drivetrain'].apply(lambda x: x.replace('4X2','Front-Wheel Drive') if pd.notnull(x) else x)

In [50]:
df['Engine'].isnull().sum()

554

In [51]:
df['Drivetrain'].value_counts()

All-Wheel Drive      654
Front-Wheel Drive    508
Four-Wheel Drive     485
Rear-Wheel Drive     167
Name: Drivetrain, dtype: int64

In [52]:
#df['Tutle'] = df['Engine'].str.extract('(V|I)\d', expand=False).str.strip()
df['Tutle'] = df['Engine'].str.extract('([V|I]+[\d]+)', expand=False)

In [53]:
df['Tutle'] = df['Engine'].str.extract('([0-9]+\\.*[0-9]*L\s[V|I]+[\d]+)', expand=False)

In [54]:
df['Engine-hp'] = df['Engine'].str.extract('([0-9]+\shp)', expand=False).str.strip()

In [55]:
df['Engine-hp'].head(2)

0       NaN
1    305 hp
Name: Engine-hp, dtype: object

In [56]:
df['Engine-L'] = df['Engine'].str.extract('([0-9]+\\.*[0-9]*L)', expand=False).str.strip()

In [57]:
#df['Engine-Type'] = df['Engine'].str.extract('([0-9]+\\.*[0-9]*L\s[V|I]+[\d]+)', expand=False)
df['Engine-Type'] = df['Engine'].str.extract('([V|I]+[\d]+)', expand=False)

In [58]:
df['Engine-Type'].value_counts()

I4     854
V6     583
V8     367
I6      88
I3      21
I5       9
V10      1
Name: Engine-Type, dtype: int64

In [59]:
df['Engine-L'].isnull().sum()

554

In [60]:
df['Engine-hp'].isnull().sum()

704

In [61]:
df['Engine-Type'].isnull().sum()

581

Drivetrain

In [62]:
df['Fuel Type'].value_counts()

Gasoline             1724
Flex Fuel Vehicle     126
Diesel                 51
Electric               35
Hybrid                 25
Biodiesel              24
Name: Fuel Type, dtype: int64

In [63]:
df[df['Engine-hp'].isnull() & df['Engine-L'].isnull() & df['Drivetrain'].isnull() & df['Fuel Type'].isnull() & df['Title'].isnull()]

Empty DataFrame
Columns: [Links, Name, Price, Location, Mileage, Transmission, Exterior Colour, Engine, Drivetrain, Fuel Type, Major Options, year, Title, Brand, Color, No_of_features, Tutle, Engine-hp, Engine-L, Engine-Type]
Index: []

In [64]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2504 entries, 0 to 2534
Data columns (total 20 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Links            2504 non-null   object
 1   Name             2504 non-null   object
 2   Price            2504 non-null   int64
 3   Location         2417 non-null   object
 4   Mileage          2504 non-null   int64
 5   Transmission     2448 non-null   object
 6   Exterior Colour  2267 non-null   object
 7   Engine           1950 non-null   object
 8   Drivetrain       1814 non-null   object
 9   Fuel Type        1985 non-null   object
 10  Major Options    2098 non-null   object
 11  year             2504 non-null   int64
 12  Title            2504 non-null   object
 13  Brand            2504 non-null   object
 14  Color            2504 non-null   object
 15  No_of_features   2098 non-null   float64
 16  Tutle            1923 non-null   object
 17  Engine-hp        1800 non-null   object
 18  Engine-L         1950 non-null   object
 19  Engine-Type      1923 non-null   object
dtypes: float64(1), int64(3), object(16)
memory usage: 490.8+ KB

In [65]:
df.head(2)

,Links,Name,Price,Location,Mileage,Transmission,Exterior Colour,Engine,Drivetrain,Fuel Type,Major Options,year,Title,Brand,Color,No_of_features,Tutle,Engine-hp,Engine-L,Engine-Type
0,ViewedSave this listing2017 Volkswagen Golf 1....,2017 Volkswagen Golf 1.8T Comfortline 4-Door F...,15990,New Westminster,83000,Automatic,White,NaN,NaN,NaN,"Bluetooth, Backup Camera, Heated Seats, CarPlay",2017,Volkswagen Golf 1.8T Comfortline 4-Door FWD,Volkswagen,White,4.0,NaN,NaN,NaN,NaN
1,ViewedSave this listing2019 RAM 1500 Classic T...,2019 RAM 1500 Classic Tradesman Crew Cab 4WD -...,38900,New Westminster,26000,Automatic,Blue,305 hp 3.6L V6 Flex Fuel Vehicle,Four-Wheel Drive,Flex Fuel Vehicle,"Alloy Wheels, Bluetooth, Backup Camera, Remote...",2019,RAM 1500 Classic Tradesman Crew Cab 4WD,RAM,Blue,7.0,3.6L V6,305 hp,3.6L,V6

Drop columns Link, Name, Engine,Tutle

In [66]:
#df.drop(['Links', 'Name', 'Engine','Tutle', 'Title', 'Exterior Colour', 'Major Options'], inplace = True, axis = 1)

In [67]:
#####################delete after usage################################## updelete after deleting this line
df.drop(['Links', 'Name', 'Engine','Tutle', 'Title', 'Exterior Colour'], inplace = True, axis = 1)

In [68]:
df.head()

,Price,Location,Mileage,Transmission,Drivetrain,Fuel Type,Major Options,year,Brand,Color,No_of_features,Engine-hp,Engine-L,Engine-Type
0,15990,New Westminster,83000,Automatic,NaN,NaN,"Bluetooth, Backup Camera, Heated Seats, CarPlay",2017,Volkswagen,White,4.0,NaN,NaN,NaN
1,38900,New Westminster,26000,Automatic,Four-Wheel Drive,Flex Fuel Vehicle,"Alloy Wheels, Bluetooth, Backup Camera, Remote...",2019,RAM,Blue,7.0,305 hp,3.6L,V6
2,28900,Port Coquitlam,49000,Automatic,All-Wheel Drive,Gasoline,"Sport Package, Bluetooth, Backup Camera, Heate...",2015,Lexus,Silver,5.0,235 hp,2L,I4
3,11980,Burnaby,216288,Automatic,Rear-Wheel Drive,Gasoline,Alloy Wheels,2003,Toyota,Red,1.0,190 hp,3.4L,V6
4,16888,Victoria,144718,Automatic,All-Wheel Drive,Gasoline,"Leather Seats, Sunroof/Moonroof, Navigation Sy...",2015,INFINITI,Black,8.0,330 hp,3.7L,V6

Strip 'L' from column Engine-L and 'hp' from column Engine-hp

In [69]:
#df['Engine-hp'] = df['Engine-hp'].apply(lambda x: str(x.replace('L', ''))  if pd.notnull(x) else x)
df['Engine-hp'] = df['Engine-hp'].map(lambda x: str(x)[:-3] if pd.notnull(x) else x)

In [70]:
df['Engine-hp'] = pd.to_numeric(df['Engine-hp'], errors='coerce')

In [71]:
df['Engine-L'] = df['Engine-L'].map(lambda x: str(x)[:-1] if pd.notnull(x) else x)

In [72]:
df['Engine-L'] = pd.to_numeric(df['Engine-L'], errors='coerce')

Convert year column from string to int

In [73]:
df['year'] = df['year'].astype(int)

Convert mileage column from string to int

In [74]:
df['Mileage'] = df['Mileage'].astype(int)

Make a column for age of the car and drop the column 'Year'

In [75]:
df['Age'] = 2022 - df['year']

In [76]:
df.drop('year', inplace = True, axis = 1)

Uncapitalize all the column names

In [77]:
df.columns= df.columns.str.lower()

In [78]:
df.columns

Index(['price', 'location', 'mileage', 'transmission', 'drivetrain',
       'fuel type', 'major options', 'brand', 'color', 'no_of_features',
       'engine-hp', 'engine-l', 'engine-type', 'age'],
      dtype='object')

In [79]:
df.head(3)

,price,location,mileage,transmission,drivetrain,fuel type,major options,brand,color,no_of_features,engine-hp,engine-l,engine-type,age
0,15990,New Westminster,83000,Automatic,NaN,NaN,"Bluetooth, Backup Camera, Heated Seats, CarPlay",Volkswagen,White,4.0,NaN,NaN,NaN,5
1,38900,New Westminster,26000,Automatic,Four-Wheel Drive,Flex Fuel Vehicle,"Alloy Wheels, Bluetooth, Backup Camera, Remote...",RAM,Blue,7.0,305.0,3.6,V6,3
2,28900,Port Coquitlam,49000,Automatic,All-Wheel Drive,Gasoline,"Sport Package, Bluetooth, Backup Camera, Heate...",Lexus,Silver,5.0,235.0,2.0,I4,7

Reindex the column names

In [80]:
df.columns

Index(['price', 'location', 'mileage', 'transmission', 'drivetrain',
       'fuel type', 'major options', 'brand', 'color', 'no_of_features',
       'engine-hp', 'engine-l', 'engine-type', 'age'],
      dtype='object')

Dealing with null values

In [86]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2504 entries, 0 to 2534
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   price           2504 non-null   int64
 1   location        2417 non-null   object
 2   mileage         2504 non-null   int32
 3   transmission    2448 non-null   object
 4   drivetrain      1814 non-null   object
 5   fuel type       1985 non-null   object
 6   major options   2098 non-null   object
 7   brand           2504 non-null   object
 8   color           2504 non-null   object
 9   no_of_features  2098 non-null   float64
 10  engine-hp       1800 non-null   float64
 11  engine-l        1950 non-null   float64
 12  engine-type     1923 non-null   object
 13  age             2504 non-null   int32
dtypes: float64(3), int32(2), int64(1), object(8)
memory usage: 353.9+ KB

It can be seen that major portion of the missing value is from the columns drivetrain, fuel type, engine-l, engine-type and major option

In [87]:
df = df[~(df['drivetrain'].isnull() & df['fuel type'].isnull() & df['engine-hp'].isnull() & df['engine-type'].isnull() & df['engine-l'].isnull())]

In [88]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2040 entries, 1 to 2533
Data columns (total 14 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   price           2040 non-null   int64
 1   location        1971 non-null   object
 2   mileage         2040 non-null   int32
 3   transmission    1997 non-null   object
 4   drivetrain      1814 non-null   object
 5   fuel type       1985 non-null   object
 6   major options   1718 non-null   object
 7   brand           2040 non-null   object
 8   color           2040 non-null   object
 9   no_of_features  1718 non-null   float64
 10  engine-hp       1800 non-null   float64
 11  engine-l        1950 non-null   float64
 12  engine-type     1923 non-null   object
 13  age             2040 non-null   int32
dtypes: float64(3), int32(2), int64(1), object(8)
memory usage: 223.1+ KB

In [89]:
df['drivetrain'].value_counts()

All-Wheel Drive      654
Front-Wheel Drive    508
Four-Wheel Drive     485
Rear-Wheel Drive     167
Name: drivetrain, dtype: int64

In [90]:
df['drivetrain'].isnull().sum()

226

Replace all the null value in drivetrain with All-Wheel Drive

In [91]:
df['drivetrain'].fillna('All-Wheel Drive', inplace = True)

C:\Users\ashra\anaconda3\lib\site-packages\pandas\core\generic.py:6245: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._update_inplace(new_data)

In [92]:
df['drivetrain'].value_counts()

All-Wheel Drive      880
Front-Wheel Drive    508
Four-Wheel Drive     485
Rear-Wheel Drive     167
Name: drivetrain, dtype: int64

In [93]:
df['drivetrain'].isnull().sum()

0

Replacing null value in transmission column

In [94]:
df['transmission'].isnull().sum()

43

Null value in the transmission column will be replaced by mode which is Automatic

In [95]:
df['transmission'].fillna('Automatic', inplace = True)

In [81]:
##############################################################################################################

In [84]:
####################################################################################################################

In [96]:
df['transmission'].isnull().sum()

0

In [82]:
#uncomment this one
#column_name = ['brand', 'mileage', 'car-type', 'age', 'transmission', 'color', 'drivetrain', 'fuel type', 'engine-hp', 'engine-l', 'engine-type', 'location','no_of_features', 'price']

In [83]:
#delete this one
column_name = ['brand', 'mileage', 'car-type', 'age', 'transmission', 'color', 'drivetrain', 'fuel type', 'engine-hp', 'engine-l', 'engine-type', 'location','no_of_features', 'major options', 'price']

Replacing null value in the column 'fuel type' as the mode of the column Gasoline

In [97]:
df['fuel type'].value_counts()

Gasoline             1724
Flex Fuel Vehicle     126
Diesel                 51
Electric               35
Hybrid                 25
Biodiesel              24
Name: fuel type, dtype: int64

In [98]:
df['fuel type'].isnull().sum()

55

In [99]:
df['fuel type'].fillna('Gasoline', inplace = True)

In [100]:
df['fuel type'].isnull().sum()

0

Replacing null value in the column 'engine-hp' by the mean of the column

In [101]:
engine_hp = df[~df['engine-hp'].isnull()]['engine-hp'].mean()
engine_hp

272.65777777777777

In [102]:
df['engine-hp'].fillna(engine_hp, inplace = True)

In [103]:
df['engine-hp'].isnull().sum()

0

Replacing null value in the column 'engine-l' by the mean of the column

In [104]:
engine_l = df[~df['engine-l'].isnull()]['engine-l'].mean()
engine_l

3.2029230769230743

In [105]:
df['engine-l'].fillna(engine_l, inplace = True)

In [106]:
# df['Location'] = df['Location'].apply(lambda x: x.split(',')[0] if pd.notnull(x) else a)
# df['Location']

Replacing null value in column no_of_feature by 0

In [107]:
df.columns

Index(['price', 'location', 'mileage', 'transmission', 'drivetrain',
       'fuel type', 'major options', 'brand', 'color', 'no_of_features',
       'engine-hp', 'engine-l', 'engine-type', 'age'],
      dtype='object')

In [108]:
df['no_of_features'].isnull().sum()

322

In [109]:
df['no_of_features'].fillna(-1, inplace = True)

In [110]:
df['no_of_features'].isnull().sum()

0

In [111]:
#converting float to string
df['no_of_features'].astype(int)

1       7
2       5
3       1
4       8
5       2
       ..
2525    6
2527    2
2528   -1
2531    8
2533    4
Name: no_of_features, Length: 2040, dtype: int32

engine-type

In [112]:
df['engine-type'].value_counts()

I4     854
V6     583
V8     367
I6      88
I3      21
I5       9
V10      1
Name: engine-type, dtype: int64

In [113]:
df['engine-type'].isnull().sum()

117

replacing null value in engine-type by mode value I4

In [114]:
df['engine-type'].fillna('I4', inplace = True)

In [115]:
df['engine-type'].isnull().sum()

0

replacing null value in location with mode location 'surrey'

In [116]:
df['location'].value_counts()

Surrey             330
Vancouver          300
Richmond           237
Victoria           145
Burnaby            135
Langley            108
Abbotsford         105
Coquitlam           89
North Vancouver     82
Chilliwack          77
Nanaimo             74
New Westminster     65
Maple Ridge         49
Langley City        49
Duncan              29
Port Coquitlam      29
Port Moody          20
Mission             13
Squamish             8
Westshore            8
Sechelt              7
Sidney               4
Pitt Meadows         3
Aldergrove           2
Delta                1
Parksville           1
West Vancouver       1
Name: location, dtype: int64

In [117]:
df['location'].isnull().sum()

69

In [118]:
df['location'].fillna('Surrey', inplace = True)

In [119]:
df['location'].isnull().sum()

0

In [142]:
#Saving the CSV for data analysis

In [130]:
df.to_csv('cargurus_eda_major_option.csv', index= False)